DEBUG_MODE = False

ENABLE_STOP_WORDS = True

STOP_WORDS = (
    '的', '了', '在', '是', '和', '也', '不', '有', '就', '与', '中',
    '你', '我', '他', '她', '它', '我们', '你们', '他们', '她们', '它们',
    '这个', '那个', '这些', '那些', '哪', '什么', '怎', '这', '那', '此',
    '每', '们', '把', '被', '个', '自己', '而', '没有', '可以', '会',
    '着', '一个', '没有', '为了', '因为', '所以', '虽然', '但是', '如果',
    '而且', '即使', '即便', '并', '从', '到', '和', '于', '之', '向', '与',
    '比', '就', '才', '让', '呢', '吗', '啊', '吧', '呀', '哇', '嗯', '哦',
    '么', '地', '得', '着', '过', '以', '之', '于', '与', '和', '并', '及',
    '或', '而', '然后', '首先', '其次', '最后', '另外', '此外', '比如',
    '例如', '比如说', '这样'
)

QUERY_MODEL_NAMES = ['bm25', 'word2vec']
# 2 表示两种方式的加权综合
QUERY_MODEL_ID = 2

WORD2VEC_MODEL_FILE = r'.\word_vec_models\text1.vector'

NUM_OF_RET_TOP_DOC = 3

